In [1]:
import numpy as np
import pandas as pd

read the csv file using read_csv function

In [3]:
score = pd.read_csv('pp.csv',header=None)

In [13]:
score.head()

        0   1   2    3   4
0  Janice  95  95   91  99
1  Vivian  96  92   88  90
2     May  99  99  100  87
3    Lisa  90  92   81  86
4   Eason  85  93   93  99

add columns, give them names

In [5]:
score.columns = ["Name","Chinese","English","Math","History"]

In [6]:
score

     Name  Chinese  English  Math  History
0  Janice       95       95    91       99
1  Vivian       96       92    88       90
2     May       99       99   100       87
3    Lisa       90       92    81       86
4   Eason       85       93    93       99

In [16]:
score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Chinese  5 non-null      int64
 2   English  5 non-null      int64
 3   Math     5 non-null      int64
 4   History  5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 328.0+ bytes

to do all these things in just one step

In [8]:
score = pd.read_csv(
    'pp.csv',
    header = None,
    names = [ 'Names','Chinese','English','Math',"History" ],
    index_col= 0
 
)
score

        Chinese  English  Math  History
Names
Janice       95       95    91       99
Vivian       96       92    88       90
May          99       99   100       87
Lisa         90       92    81       86
Eason        85       93    93       99

In [9]:
score.loc["Janice"] #after index_col = 0, the first column become the index of the data frame

Chinese    95
English    95
Math       91
History    99
Name: Janice, dtype: int64

data cleaning

In [11]:
pd.isnull(np.nan)

True